Reports/ИзвещенияВВоенкоматы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ИзвещенияВВоенкоматы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВоинскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскойОбязанности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскомуУчету</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскомуУчету</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВоинскиеЗвания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВУС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Годность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГодностьКВоеннойСлужбе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Военкомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеМобпредписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабронированОрганизацией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеНегодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпецУчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДо2016</Name>
					<Comment>Группа (до даты вступления в силу порядка №921 от 07.12.16 г.)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрофилиОфицеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИНомерПриказаОПризыве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокКонтракта</Name>
					<Comment>Для службы по контракту</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВоенкоматФМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыВоенногоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СемейноеПоложениеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СемейноеПоложениеФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СемейноеПоложение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СемейноеПоложениеФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтношениеКВоинскойОбязанности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскойОбязанности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Военнообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВоеннообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ИзвещенияВВоенкоматы/Ext/ObjectModule.bsl
#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Настройка периода
Перем НП Экспорт;

Перем мНазваниеОтчета Экспорт; // название отчета

Перем мСтруктураДляОтбораПоКатегориям Экспорт; // содержит связь отборов текста запроса Построителя и значений категорий

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	КодЯзыкаПечать = "uk";
	мНазваниеОтчета = НСтр("ru='Извещения в военкоматы о принятых и уволенных военнообязанных';uk='Повідомлення до військоматів про прийнятих та звільнених військовозобов’язаних'",КодЯзыкаПечать);
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Призывники.Военкомат КАК Военкомат,
	|	Призывники.Физлицо,
	|	ВЫБОР КОГДА (ФИОФизЛиц.Фамилия) ЕСТЬ NULL  ТОГДА Призывники.Физлицо.Наименование ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество КОНЕЦ КАК ФиоПолное,
	|	Призывники.ТекстЗвание,
	|	Призывники.Звание КАК Звание,
	|	Призывники.ВУС КАК ВУС,
	|	Призывники.Регистратор КАК Регистратор,
	|	Призывники.НомерРегистратора КАК НомерРегистратора,
	|	Призывники.ДатаРегистратора КАК ДатаРегистратора,
	|	Призывники.РеквизитыВоенногоБилета КАК РеквизитыВоенногоБилета,
	|	ГОД(Призывники.Физлицо.ДатаРождения) КАК ГодРождения,
	|	ВЫБОР КОГДА Призывники.УровеньОбразования = 4 ТОГДА &ВысшееОбразование КОГДА Призывники.УровеньОбразования = 0 ТОГДА """+НСтр("ru='Другое образование';uk='Інша освіта'",КодЯзыкаПечать)+""" ИНАЧЕ ФизическиеЛицаОбразование.ВидОбразования КОНЕЦ КАК Образование,
	|	СемейноеПоложениеФизЛиц.СемейноеПоложение КАК СемейноеПоложение,
	|	ФактическийАдрес.Представление КАК ФактическийАдрес,
	|	АдресПрописки.Представление КАК АдресПрописки,
	|	ДомашнийТелефон.Представление КАК ДомашнийТелефон,
	|	Призывники.Событие,
	|	Призывники.ДатаСобытия,
	|	Призывники.ДолжностьРаботника,
	|	Призывники.Организация КАК Организация,
	|	Призывники.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	АдресОрганизации.Представление КАК АдресОрганизации,
	|	ТелефонОрганизации.Представление КАК ТелефонОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		Призывники.Физлицо КАК Физлицо,
	|		Призывники.Звание КАК Звание,
	|		Призывники.Военкомат КАК Военкомат,
	|		Призывники.РеквизитыВоенногоБилета КАК РеквизитыВоенногоБилета,
	|		Призывники.ВУС КАК ВУС,
	|		Призывники.Регистратор КАК Регистратор,
	|		Призывники.НомерРегистратора КАК НомерРегистратора,
	|		Призывники.ДатаРегистратора КАК ДатаРегистратора,
	|		Призывники.Организация КАК Организация,
	|		Призывники.ДатаСобытия КАК ДатаСобытия,
	|		МАКСИМУМ(ВЫБОР КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&СписокВысшегоОбразования) ТОГДА 4 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПрофессиональноеОбразование ТОГДА 3 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &НачальноеПрофессиональноеОбразование ТОГДА 2 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПолноеОбщееОбразование ТОГДА 1 КОГДА ФизическиеЛицаОбразование.ВидОбразования <> &ПустоеОбразование ТОГДА 1 ИНАЧЕ -(1) КОНЕЦ) КАК УровеньОбразования,
	|		Призывники.Событие КАК Событие,
	|		Призывники.ТекстЗвание КАК ТекстЗвание,
	|		Призывники.ДолжностьРаботника КАК ДолжностьРаботника
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|			ВоинскийУчетСрезПоследних.Звание КАК Звание,
	|			ВоинскийУчетСрезПоследних.Военкомат КАК Военкомат,
	|			ВоинскийУчетСрезПоследних.РеквизитыВоенногоБилета КАК РеквизитыВоенногоБилета,
	|			ВоинскийУчетСрезПоследних.ВУС КАК ВУС,
	|			ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием 
	|           	ТОГДА ""Прийом на роботу в організацію"" 
	|				ИНАЧЕ ""Звільнення з організації"" КОНЕЦ КАК Регистратор,
	|           РаботникиОрганизации.Регистратор.Номер КАК НомерРегистратора,
	|           РаботникиОрганизации.Регистратор.Дата КАК ДатаРегистратора,
	|			РаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК Организация,
	|			ВЫБОР
	|				КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием
	|					ТОГДА РаботникиОрганизации.Период
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизации.Период, ДЕНЬ, -1)
	|			КОНЕЦ КАК ДатаСобытия,
	|			ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием ТОГДА """+НСтр("ru='Принят';uk='Прийнято'",КодЯзыкаПечать)+""" ИНАЧЕ """+НСтр("ru='Уволен';uk='Звільнено'",КодЯзыкаПечать)+""" КОНЕЦ КАК Событие,
	|			ВЫБОР КОГДА ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = &Призывник ТОГДА """+НСтр("ru='гражданин, подлежащий призыву на военную службу';uk='громадянин, що підлягає призову на військову службу'",КодЯзыкаПечать)+""" ИНАЧЕ ВоинскийУчетСрезПоследних.Звание.Наименование + """+НСтр("ru=' запаса; ВУС № ';uk=' запасу; ВОС № '",КодЯзыкаПечать)+""" + ВоинскийУчетСрезПоследних.ВУС КОНЕЦ КАК ТекстЗвание,
	|			ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Прием ТОГДА """+НСтр("ru='на должность ';uk='на посаду '",КодЯзыкаПечать)+""" + РаботникиОрганизации.Должность.Наименование ИНАЧЕ """" КОНЕЦ КАК ДолжностьРаботника
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаКон, ) КАК ВоинскийУчетСрезПоследних
	|				ПО РаботникиОрганизации.Сотрудник.Физлицо = ВоинскийУчетСрезПоследних.Физлицо
	|		
	|		ГДЕ
	|			РаботникиОрганизации.Период МЕЖДУ &ДатаНач И &ДатаКон И
	|			РаботникиОрганизации.ПричинаИзмененияСостояния <> &Перемещение И
	|			ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности В(&Военнообязанные) И
	|			(РаботникиОрганизации.Сотрудник.ВидЗанятости <> &ВнутреннееСовместительство)
	|	
	|		{ГДЕ
	|	    	Организация, Военкомат, ПричинаИзмененияСостояния КАК Событие, РаботникиОрганизации.Сотрудник.Физлицо.*
	|		}
	|	    ) КАК Призывники
	|	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|			ПО Призывники.Физлицо = ФизическиеЛицаОбразование.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Призывники.Физлицо,
	|		Призывники.Звание,
	|		Призывники.Военкомат,
	|		Призывники.РеквизитыВоенногоБилета,
	|		Призывники.ВУС,
	|		Призывники.Регистратор,
	|		Призывники.НомерРегистратора,
	|		Призывники.ДатаРегистратора,
	|		Призывники.Организация,
	|		Призывники.ДатаСобытия,
	|		Призывники.Событие,
	|		Призывники.ТекстЗвание,
	|		Призывники.ДолжностьРаботника) КАК Призывники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(&ДатаКон, ) КАК СемейноеПоложениеФизЛиц
	|		ПО Призывники.Физлицо = СемейноеПоложениеФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаКон, ) КАК ФИОФизЛиц
	|		ПО Призывники.Физлицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактическийАдрес
	|		ПО Призывники.Физлицо = ФактическийАдрес.Объект И (ФактическийАдрес.Тип = &Адрес) И (ФактическийАдрес.Вид = &ФактическийАдрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресПрописки
	|		ПО Призывники.Физлицо = АдресПрописки.Объект И (АдресПрописки.Тип = &Адрес) И (АдресПрописки.Вид = &АдресПрописки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашнийТелефон
	|		ПО Призывники.Физлицо = ДомашнийТелефон.Объект И (ДомашнийТелефон.Тип = &Телефон) И (ДомашнийТелефон.Вид = &ДомашнийТелефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|		ПО Призывники.Физлицо = ФизическиеЛицаОбразование.Ссылка И (Призывники.УровеньОбразования = ВЫБОР КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&ВысшееОбразование) ТОГДА 4 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПрофессиональноеОбразование ТОГДА 3 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &НачальноеПрофессиональноеОбразование ТОГДА 2 КОГДА ФизическиеЛицаОбразование.ВидОбразования = &СреднееПолноеОбщееОбразование ТОГДА 1 ИНАЧЕ 0 КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресОрганизации
	|		ПО Призывники.Организация = АдресОрганизации.Объект И (АдресОрганизации.Тип = &Адрес) И (АдресОрганизации.Вид = &АдресОрганизации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонОрганизации
	|		ПО Призывники.Организация = ТелефонОрганизации.Объект И (ТелефонОрганизации.Тип = &Телефон) И (ТелефонОрганизации.Вид = &ТелефонОрганизации)
	|	
	|{УПОРЯДОЧИТЬ ПО
	|	Призывники.Военкомат, Организация, Событие, Физлицо.*
	|}
	|";	
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
							  
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("Военкомат");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
КонецПроцедуры










Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт
	
	ВысшееОбразование = Новый Массив;
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.Аспирантура);
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.АдъюнктураОрдинатура);
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.ВысшееОбразование);
	ВысшееОбразование.Добавить(Справочники.ВидыОбразованияФизЛиц.Докторантура);
	
	ПостроительОтчета.Параметры.Вставить("СреднееПолноеОбщееОбразование", Справочники.ВидыОбразованияФизЛиц.СреднееПолноеОбщееОбразование);
	ПостроительОтчета.Параметры.Вставить("НачальноеПрофессиональноеОбразование", Справочники.ВидыОбразованияФизЛиц.НачальноеПрофессиональноеОбразование);
	ПостроительОтчета.Параметры.Вставить("СреднееПрофессиональноеОбразование", Справочники.ВидыОбразованияФизЛиц.СреднееПрофессиональноеОбразование);
	ПостроительОтчета.Параметры.Вставить("ВысшееОбразование", Справочники.ВидыОбразованияФизЛиц.ВысшееОбразование); 
	ПостроительОтчета.Параметры.Вставить("ПустоеОбразование", Справочники.ВидыОбразованияФизЛиц.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("СписокВысшегоОбразования", ВысшееОбразование);
	ПостроительОтчета.Параметры.Вставить("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПостроительОтчета.Параметры.Вставить("ФактическийАдрес", Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	ПостроительОтчета.Параметры.Вставить("АдресПрописки", Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	ПостроительОтчета.Параметры.Вставить("АдресОрганизации", Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ПостроительОтчета.Параметры.Вставить("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПостроительОтчета.Параметры.Вставить("ДомашнийТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний);
	ПостроительОтчета.Параметры.Вставить("ТелефонОрганизации", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ПостроительОтчета.Параметры.Вставить("Перемещение", Перечисления.ПричиныИзмененияСостояния.Перемещение);
	ПостроительОтчета.Параметры.Вставить("Прием", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	Военнообязанные = Новый Массив;
	Военнообязанные.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	Военнообязанные.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	ПостроительОтчета.Параметры.Вставить("Военнообязанные", Военнообязанные);
	
	ПостроительОтчета.Параметры.Вставить("Призывник", Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	ПостроительОтчета.Параметры.Вставить("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);

    // Проверка на пустые значения
	Если ПустаяСтрока(ПостроительОтчета.Текст) Тогда
		
		Предупреждение("Не определен запрос отчета!");
		
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;

	Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ УправлениеОтчетами.ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
		//повторные отборы по категориям
		Предупреждение("По одной категории нельзя устанавливать два отбора", 60);
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;

	УправлениеОтчетами.ПроверитьПорядокПостроителяОтчета(ПостроительОтчета);

	ПостроительОтчета.Параметры.Вставить("ДатаНач", ДатаНач);
	Если ДатаКон <> '00010101000000' Тогда
		ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ДатаКон));
	Иначе
		ПостроительОтчета.Параметры.Вставить("ДатаКон", '00010101000000');
	КонецЕсли;

	МакетОтчета = ПолучитьМакет("Макет");
	
	// печать производится на языке, указанном в настройках пользователя
	
	
	// Заголовок отчета
	ДокументРезультат.Очистить();


	// Исполнение запроса
	ПостроительОтчета.Выполнить();

	// Вывод в отчет
	ОбластьИзвещение = МакетОтчета.ПолучитьОбласть("Извещение");
	
	ФизЛицоОтветственного = Ответственный.ФизЛицо;
	Если ЗначениеЗаполнено(ФизЛицоОтветственного) Тогда
		
		Запрос = Новый Запрос();
		ТекстУсловий = "";
		Если ПостроительОтчета.Отбор.Организация.Использование Тогда
			ТекстУсловий = ", СтруктурнаяЕдиница = &Организация";
			Запрос.УстановитьПараметр("Организация",ПостроительОтчета.Отбор.Организация.Значение);
		КонецЕсли;
		
		ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьОтветственного,
			|	ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """" 
			|		ТОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" 
			|		ИНАЧЕ """" 
			|	КОНЕЦ + 
			|	ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """" 
			|		ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + ""."" 
			|		ИНАЧЕ """" 
			|	КОНЕЦ +
			|	ВЫБОР КОГДА НЕ (ФИОФизЛицСрезПоследних.ФизЛицо) ЕСТЬ NULL 
			|		ТОГДА "" "" + ФИОФизЛицСрезПоследних.Фамилия  
			|КОНЕЦ КАК ФИОКраткое
			|ИЗ
			|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаКон" + ТекстУсловий + ") КАК ОтветственныеЛицаОрганизацийСрезПоследних
			|ЛЕВОЕ СОЕДИНЕНИЕ 
			|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаКон, ФизЛицо = &ФизическоеЛицо) КАК ФИОФизЛицСрезПоследних
			|ПО
			|   ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|ГДЕ
			|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
			
		Запрос.Текст = ТекстЗапроса;

		Запрос.УстановитьПараметр("ФизическоеЛицо",ФизЛицоОтветственного);
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
		    ОбластьИзвещение.Параметры.Заполнить(Выборка);
		    ОбластьИзвещение.Параметры.ФИООтветственного = Выборка.ФИОКраткое;
		КонецЕсли;
	КонецЕсли;
	
	// вывод самих извещений
	Выборка = ПостроительОтчета.Результат.Выбрать();
	
	МассивДлинСтрок = Новый Массив;
	МассивДлинСтрок.Добавить(63);
	МассивДлинСтрок.Добавить(96);
		
	МассивДлинСтрок.Установить(0,63);
		
	Пока Выборка.Следующий() Цикл
		ОбластьИзвещение.Параметры.АдресМестаПроживания1 = "";
		ОбластьИзвещение.Параметры.АдресМестаПроживания2 = "";
		ОбластьИзвещение.Параметры.Военкомат1 = "";
		ОбластьИзвещение.Параметры.Военкомат2 = "";
		
	    ОбластьИзвещение.Параметры.Заполнить(Выборка);
		
		ОбластьИзвещение.Параметры.ДатаРегистратора = Формат(Выборка.ДатаРегистратора, "Л='uk';ДФ=дд.MM.гггг") + "р.";
		
		ОбластьИзвещение.Параметры.ДатаРождения = Выборка.Физлицо.ДатаРождения;
		РезультирующаяСтрокаАдрес = ОбщегоНазначения.РазбитьСтрокуНаПодСтроки(Выборка.ФактическийАдрес, МассивДлинСтрок);
		Для Счетчик = 1 По ?(СтрЧислоСтрок(РезультирующаяСтрокаАдрес) <= 2, СтрЧислоСтрок(РезультирующаяСтрокаАдрес), 2)  Цикл
			ОбластьИзвещение.Параметры["АдресМестаПроживания"+Счетчик] = СтрЗаменить(СтрПолучитьСтроку(РезультирующаяСтрокаАдрес, Счетчик),Символы.ПС, "");  
		КонецЦикла;
		
		МассивДлинСтрок.Установить(0,55);
		
		РезультирующаяСтрокаВоенкомат = ОбщегоНазначения.РазбитьСтрокуНаПодСтроки(Выборка.Военкомат, МассивДлинСтрок);
		Для Счетчик = 1 По ?(СтрЧислоСтрок(РезультирующаяСтрокаВоенкомат) <= 2, СтрЧислоСтрок(РезультирующаяСтрокаВоенкомат), 2)  Цикл
			ОбластьИзвещение.Параметры["Военкомат"+Счетчик] = СтрЗаменить(СтрПолучитьСтроку(РезультирующаяСтрокаВоенкомат, Счетчик),Символы.ПС, "");  
		КонецЦикла;
		

		ДокументРезультат.Вывести(ОбластьИзвещение);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	

	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);

	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "ИзвещенияВВоенкоматы";

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

ПоказыватьЗаголовок = Истина;

#КонецЕсли
